Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ནམ་སེམས་ཅན་རྣམས་རང་སངས་རྒྱས་ཀྱིས་འདུལ་བ་ཡིན་གྱི། ཉན་ཐོས་ཀྱིས་འདུལ་བ་མ་ཡིན། སངས་རྒྱས་ཀྱིས་འདུལ་བ་མ་ཡིན་པ་དེ་ན་རང་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་སྤྲུལ་ནས་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཀྱི་ལམ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། དབེན་པའི་གཏམ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་གཏམ་དང་། བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་།
en: “During times when beings are trained by pratyekabuddhas and not by śrāvakas or buddhas, bodhisattvas emanate in the form of pratyekabuddhas and reveal the path of a pratyekabuddha’s awakening.

source: རྣམ་པར་ཐར་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པའི་གཏམ་དང་། སྦྱིན་གནས་ཆེན་པོར་དབང་སྐུར་བའི་གཏམ་དང་། རྟེན་པའི་གཏམ་དང་། རྣམ་པར་ཐར་པའི་ཚུལ་གྱིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: They ripen beings through instructions on isolation and freedom from attachment; instructions on meditative stability, samādhi, meditative attainment, and liberation; and instructions on the bases of miraculous power, being anointed as a worthy recipient of offerings, stability, and the way of liberation.

source: ནམ་སེམས་ཅན་རྣམས་བྱང་ཆུབ་སེམས་དཔས་འདུལ་བར་འགྱུར་བ་དེ་ན་རང་གི་གཟུགས་སུ་གནས་ནས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་བྱིན་གྱི་རླབས་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། གཟུངས་དང་། དབང་དང་། བཟོད་པ་དང་། སའི་གཏམ་གྱིས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: “During times when beings are tamed by bodhisattvas, bodhisattvas remain in their own form and ripen those beings through instructions on the six perfections, the four transformative powers, great love, great compassion, dhāraṇī, power, tolerance, and the bodhisattva levels.

source: ནམ་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་དབང་པོ་དང་། ཁམས་རྒྱ་ཆེ་ཞིང་རྒྱས་པར་གྱུར་པ་དེ་ན་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་བསྒྱུར་ནས་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་གཏམ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཆེན་པོ་རྣམས་ཀྱིས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: “During times when beings with vast and extensive sense faculties and elements are to be tamed by a buddha, bodhisattvas transform into buddhas and ripen those beings through instructions on strength, fearlessness, and the unique qualities of a buddha, as well as through the great miraculous emanations of a buddha.

source: ནམ་སེམས་ཅན་རྣམས་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེན་པོས་འདུལ་བར་འགྱུར་བ་དེ་ན་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལག་མཐིལ་ལྟར་མཉམ་པ། འཇམ་པ་ཀ་ཙ་ལིན་དི་ཀ་ལྟར་རེག་ན་བདེ་བ་བཻ་དཱུརྱ་སྔོན་པོར་གྱུར་ལ། ཤེལ་དུ་གྱུར་པ། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོར་གྱུར་པ། འཛམ་བུ་ཆུ་བོའི་གསེར་དུ་གྱུར་པ།
en: “During times when beings are tamed by vast buddhafields, bodhisattvas ripen those beings by emanating as a trichiliocosm that is as flat as the palm of a hand and pleasant to touch like soft kācalindika—one as blue as lapis, crystalline, and made of uragasāra sandalwood and gold from the Jambu River.

source: རྡོ་དང་། གསེག་མ་དང་། གྱོ་མོ་མེད་པ། མཐོ་དམའ་མེད་པ།
en: It is free of stones, sand, and gravel, and the land does not rise and fall.

source: ངན་སོང་ལོག་པར་ལྟུང་བ་མེད་པ། བུད་མེད་རྒྱུ་བ་མེད་པ། རི་ནག་པོ་མེད་པ།
en: There is no chance of falling into the lower realms, no influence of women, and no Black Mountains.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རི་རྣམས་ཀྱིས་མཛེས་པར་བྱས་པ། ཚེར་མ་དང་ངམ་གྲོག་དང་གཡང་ས་མེད་པ་དང་། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་དང་།
en: The realm is beautified by various jewel mountains, is free of thorns, chasms, and precipices, and is graced with tracts of bejeweled and fragrant trees.

source: སྤོས་ཀྱི་ཤིང་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བྱས་པ་སྤྲུལ་ནས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །ནམ་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་རྒྱ་ཆེན་པོས་འདུལ་བར་འགྱུར་བ་དེ་ན་བྱང་ཆུབ་ཀྱི་ཤིང་དཔག་ཚད་བཅུ་གཉིས་ཀྱི་ཚད་དུ་མངོན་པར་སྤྲུལ་ཏེ། རྩ་བ་ཤིན་ཏུ་ཟུག་པ།
en: “During times when beings are tamed by the broad seat of awakening, bodhisattvas ripen beings by emanating as the tree of awakening that is twelve yojanas in size with roots that are firmly planted.

source: སྡོང་པོ་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར། ཡལ་ག་ནི་གསེར་དང་དངུལ་དང་བཻ་དཱུརྱ་དང་ཤེལ་དང་རིན་པོ་ཆེ་ཐ་དད་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ལོ་མས་མཛེས་པར་བྱས་པ།
en: It is graced with a trunk of gold from the Jambu River, branches of gold, silver, lapis, crystal, and jewels, and leaves of various gems.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དུ་མ་གནས་པ་སྤྲུལ་ནས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: It is also home to hundreds of thousands of goddesses.

source: ནམ་སེམས་ཅན་རྣམས་འཁོར་རྒྱ་ཆེན་པོས་འདུལ་བར་གྱུར་པ་དེ་ན་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། བརྒྱ་བྱིན་དང་ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་གཟི་བརྗིད་ཆེ་བ་གཟི་བརྗིད་ཆེ་བ་སྤྲུལ།
en: “During times when beings are tamed by a great retinue, bodhisattvas ripen beings by emanating as a brilliantly resplendent host of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, śakras, brahmās, and the world guardians.

source: ཉན་ཐོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཐོབ་པ། གཉི་གའི་ཆ་ལས་རྣམ་པར་གྲོལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་ལ་གནས་པ། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་རྣམས་སྤྲུལ་ནས་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ།
en: They emanate as śrāvakas who have attained the correct discernments and are liberated from both factors, and as bodhisattvas on the ten bodhisattva levels who have attained the samādhi of valiant progress.

source: རིགས་ཀྱི་བུ་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་དང་བཅུ་པོ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཕྲུལ་པ་ཆེན་པོ་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Child of good family, the great emanations of bodhisattvas should be understood through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: “Child of good family, bodhisattvas should realize the ripening power of the virtues through ten approaches to the way of the Dharma.

source: དཔེར་ན་ཆུ་ཟླ་ནི་ནམ་མཁའི་ཟླ་བའི་གཟུགས་བརྙན་ཡིན་མོད་ཀྱི། ཆུ་ཟླ་ནི་ཡོད་པ་མ་ཡིན་ནོ། །
en: (1) “As an analogy, the moon reflected in water is an image of the moon in the sky, but there is no moon in the water.

source: དེ་བཞིན་དུ་དགེ་བ་མངོན་པར་འདུ་བྱེད་པའི་རྐྱེན་ལས་རྣམ་པར་སྨིན་པ་དགེ་བ་སྣ་ཚོགས་ཡིད་དུ་འོང་བ་འབྱུང་སྟེ།
en: In the same way, virtue that has ripened based on contrived virtue appears as various pleasing types of virtue.

source: ཇི་ལྟར་ནམ་མཁའི་ཟླ་བ་ཆུའི་ནང་དུ་མི་འཕོ་བ་དེ་བཞིན་དུ་དགེ་བའི་ལས་ཀྱི་སྲིད་པ་འདུ་བྱེད་རྣམས་ཀྱང་སྲིད་པ་འདུ་བྱེད་རྣམས་སུ་འཕོ་བ་ཡང་མ་ཡིན་ལ།
en: Just as the moon in the sky is not transferred into the water, the formations of virtuous actions also do not transfer into the formations of existence.

source: ལས་ཀྱི་སྲིད་པའི་རྐྱེན་ལས་ཀྱང་སྲིད་པའི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །
en: And yet, there is the capacity for the formations of existence to arise from the condition of actions.

source: འདི་ལྟ་སྟེ། དཔེར་ན་རྨ་བྱའི་མདོངས་གཅིག་ལས་སྲོག་ཆགས་རྣམས་ལ་གཟུགས་དུ་མར་སྣང་ངོ་། །
en: (2) “As a further analogy, a variety of images can appear to different beings in the single spot on a peacock’s plume.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བ་མངོན་པར་འདུ་བྱ་བ་གཅིག་ལས་རྣམ་པར་སྨིན་པ་རྣམ་པ་དུ་མར་སྣང་སྟེ།
en: In the same way, a single contrived virtuous act performed by a bodhisattva can appear in a variety of resultant forms.

source: ལས་ཀྱི་སྲིད་པའི་འདུ་བྱེད་དེ་དག་རྨ་བྱའི་མདོངས་སུ་མི་འཕོ་མོད་ཀྱི། དེའི་རྐྱེན་ལས་རྨ་བྱའི་མདོངས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །
en: Even though those formations of actions do not transfer into the spot on a peacock’s plume, those conditions allow for the ripening force of the peacock’s spot.

source: དེ་བཞིན་དུ་དགེ་བའི་ལས་ཀྱི་སྲིད་པ་བསགས་པ་ཡང་སྲིད་པར་འཕོ་བ་མ་ཡིན་ཡང་། དགེ་བའི་ལས་ཀྱི་སྲིད་པ་ལ་བརྟེན་ནས་ཡང་སྲིད་པའི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །
en: In the same way, the accumulation of virtuous actions does not transfer to the next existence; rather, the force for the ripening of the next existence arises based on virtuous actions.

source: འདི་ལྟ་སྟེ། དཔེར་ན་ཤིན་ཏུ་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་དགེ་བ་མངོན་པར་འདུ་བྱ་བ་མངོན་པར་འདུ་བྱེད་པས་ནམ་མཁའ་ལས་མེ་ཏོག་གི་ཆར་འབབ་ཅིང་མེ་ཏོག་དེ་དག་གཟུགས་དང་དྲི་ལ་སོགས་པར་དབང་བ་ཉིད་དུ་འགྱུར་ཡང་།
en: (3) “As a further analogy, there is the capacity for a rain of flowers to fall from the sky—and for these flowers to be beautiful, fragrant, and so forth—based on the creation of exceptionally wondrous virtue.

source: གང་དགེ་བའི་རྩ་བ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་བྱས་པ་དེ་དག་ནམ་མཁའི་མེ་ཏོག་དེ་དག་ཏུ་མི་འཕོ་སྟེ།
en: And yet, those exceptionally wondrous roots of virtue are not transferred into those flowers in the sky.

source: ངོ་མཚར་རྨད་དུ་བྱུང་བའི་མཚན་ཉིད་ཀྱང་གཞན་ལ། མེ་ཏོག་དེ་དག་གི་མཚན་ཉིད་ཀྱང་གཞན་ནོ། །
en: The characteristics of the exceptionally wonderful virtue are one thing, and the characteristics of those flowers are another.

source: དེ་བཞིན་དུ་དགེ་བའི་ལས་ཀྱི་སྲིད་པ་ཡང་ཡང་སྲིད་པའི་དགེ་བར་འཕོ་བ་ཡང་མ་ཡིན་ལ། དགེ་བའི་ལས་ཀྱི་སྲིད་པའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །འདི་ལྟ་སྟེ།
en: In the same way, virtuous action does not transfer to the virtue of the next existence; rather, it is the force for the ripening of actions as virtuous actions.

source: དཔེར་ན་ཤིན་ཏུ་ཆོས་སྤྱོད་པ་རྣམས་ལ་སིལ་སྙན་རྣམས་མ་བསྐྱོད་པར་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རང་སྒྲ་འབྱུང་ཡང་ཆོས་སྤྱོད་པ་དེ་སིལ་སྙན་རྣམས་སུ་འཕོ་བ་མ་ཡིན་ཏེ།
en: (4) “As a further analogy, for skilled Dharma practitioners, the sound of cymbals arises naturally without moving the cymbals during offering rites. The practitioners are not transferred to the cymbals.

source: ཆོས་སྤྱོད་པའི་མཚན་ཉིད་ཀྱང་གཞན་ལ། སིལ་སྙན་དེ་དག་གི་མཚན་ཉིད་ཀྱང་གཞན་མོད་ཀྱི།
en: The characteristics of the practitioners are one thing, and the characteristics of the cymbals are another.

source: ཆོས་སྤྱོད་པའི་རྐྱེན་གྱིས་སིལ་སྙན་རྣམས་མ་བསྐྱོད་པར་རང་སྒྲ་འབྱུང་ངོ་། །
en: And yet, the sound arises naturally without moving the cymbals based on the condition of the practitioner.

source: དེ་བཞིན་དུ་རབ་ཏུ་བྱས་པའི་དགེ་བའི་ལས་ཀྱི་སྲིད་པའི་འདུ་བྱེད་རྣམས་ཡང་སྲིད་པའི་འདུ་བྱེད་རྣམས་སུ་འཕོ་བ་མ་ཡིན་ཏེ། རབ་ཏུ་ཆོས་སྤྱོད་པའི་རྐྱེན་གྱིས་རབ་ཏུ་ཡང་སྲིད་པའི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །
en: In the same way, the formations of enacted virtuous actions do not transfer to the next existence, but the ripening force in the next existence is based on the corresponding conditions of the previous Dharma practice.

source: འདི་ལྟ་སྟེ། དཔེར་ན་འབྱུང་བ་ཆེན་པོའི་དབང་གིས་ནམ་མཁའ་ལ་འཇའ་འབྱུང་ཡང་དེར་འབྱུང་བ་ཆེན་པོ་རྣམས་འཕོ་བ་ཡང་མ་ཡིན་ལ། འབྱུང་བ་ཆེན་པོའི་རྐྱེན་གྱིས་འཇའི་གཟུགས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་སྟེ།
en: (5) “As a further analogy, a rainbow appears in the sky through the power of the great elements, but the great elements are not transferred to it; rather, the ripening force of the form of the rainbow is based on the great elements as conditions.

source: དེ་ལ་གང་ཁ་དོག་སྐྱ་བོར་སྣང་བ་དེ་ནི་སའི་ཁམས་ཀྱི་དབང་ངོ་། །དེ་ལ་གང་ཁ་དོག་སྔོན་པོར་སྣང་བ་དེ་ནི་ཆུའི་ཁམས་ཀྱི་དབང་ངོ་། །དེ་ལ་གང་ཁ་དོག་དམར་པོར་སྣང་བ་དེ་ནི་མེའི་ཁམས་ཀྱི་དབང་ངོ་། །གང་གཞུའི་དབྱིབས་ལྟར་འདུག་པའམ། ཟླུམ་པོར་འདུག་པ་དེ་ནི་རླུང་གི་ཁམས་ཀྱི་དབང་ངོ་། །
en: The color yellow appears due to the influence of the earth element, the color blue due to the influence of the water element, the color red due to the influence of the fire element, and the bow-like or round shape is due to the influence of the air element.

source: དེ་བཞིན་དུ་དགེ་བའི་ལས་ཀྱི་འདུ་བྱེད་བྱས་པ་རྣམས་ཀྱི་དགེ་བའི་ལས་ཀྱི་སྲིད་པའི་དབང་གིས་ཡང་སྲིད་པའི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་འབྱུང་ངོ་། །
en: In the same way, the ripening force in the next existence is based on the power of the formations of virtuous actions of those who previously created formations of virtuous actions.

source: འདི་ལྟ་སྟེ། དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་སྡོམ་པའི་རྐྱེན་གྱིས་རིན་པོ་ཆེ་སྣ་བདུན་དང་འབྲས་ས་བོན་མ་བཏབ་མ་རྨོས་པར་འབྱུང་ཡང་།
en: (6) “As a further analogy, the seven jewels of a universal monarch and their effects arise based on the commitment to the path of the ten virtuous actions; they do not require the sowing of seeds or cultivation.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་སྡོམ་པ་རྐྱེན་དུ་གྱུར་པ་དེ་རིན་པོ་ཆེ་དེ་རྣམས་དང་འབྲས་རྣམས་སུ་འཕོས་པ་ཡང་མ་ཡིན་ལ།
en: The condition of being committed to the path of the ten virtuous actions does not transfer to those jewels or their effects.

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་གྱི་སྡོམ་པའི་རྐྱེན་གྱིས་འཁོར་ལོས་སྒྱུར་བའི་དབང་བ་ཉིད་ཀྱང་འབྱུང་ངོ་། །
en: Rather, the ripening force for being a universal monarch is based on the commitment to the path of the ten virtuous actions.

source: དེ་བཞིན་དུ་དགེ་བ་ལེགས་པར་བྱས་པ་ཤིན་ཏུ་མཐར་ཕྱིན་པ་ལེགས་པར་བརྩམས་པ་ལས་ཡང་སྲིད་པའི་དགེ་བའི་རྣམ་པར་སྨིན་པ་འབྱུང་ཡང་ལས་ཀྱི་སྲིད་པ་ཡང་སྲིད་པར་འཕོ་བ་མ་ཡིན་ཏེ།
en: In the same way, the ripening of virtue in the next existence arises from well-performed virtue that was vigorously perfected; actions do not transfer to the next existence.

source: དེའི་ཕྱིར་རྣམ་པར་སྨིན་པ་མི་འདྲ་བ་ཞེས་བྱའོ། །
en: This is known as ‘dissimilar ripening.’

source: འདི་ལྟ་སྟེ། དཔེར་ན་ལྷ་རབ་ཏུ་དགེ་བ་དང་ལྡན་པ་རྣམས་ཀྱི་མེ་ཏོག་མན་དཱ་ར་བ་བསྐྱེད་མི་དགོས་པ་དང་གཞལ་མེད་ཁང་བྱ་མི་དགོས་པ་དང་།
en: (7) “As a further analogy, the mandārava flowers of gods who are rich in virtue appear without needing to grow, their palaces without needing to be constructed, and their ambrosial food without needing to be prepared.

source: བདུད་རྩིའི་ཟས་བསྒྲུབ་མི་དགོས་པར་འབྱུང་ཡང་དགེ་བའི་འདུ་བྱེད་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེ་དག་འཕོ་བ་མ་ཡིན་ཏེ། དགེ་བའི་འདུ་བྱེད་ཀྱི་རྐྱེན་གྱིས་ལྷའི་རྣམ་པར་སྨིན་པའི་དབང་བ་འབྱུང་ངོ་། །
en: These results of virtuous karmic formations do not transfer, but the ripening force for being a god is based on virtuous formations.

source: འདི་ལྟ་སྟེ། དཔེར་ན་རྫུ་འཕྲུལ་ཆེན་པོ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པའི་རྐྱེན་གྱིས་སྒྲིབ་པ་མེད་པར་དབང་བ་ཉིད་འབྱུང་ཡང་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པ་སྒྲིབ་པ་མེད་པར་འཕོ་བ་ཡང་མ་ཡིན་ལ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱེད་པའི་རྐྱེན་གྱིས་རྫུ་འཕྲུལ་དང་ལྡན་པ་རྣམས་ཀྱི་སྒྲིབ་པ་མེད་པ་ཡང་འབྱུང་སྟེ།
en: (8) “As a further analogy, for those with great magical ability, the capacity to be unhindered derives from their contrived magical creations, but those contrived magical creations do not transfer to the condition of being unhindered; rather, for a person with magical power the condition of being unhindered is based on the contrived magical creations.

source: རི་ལ་སོགས་པ་འཕོ་བ་ཡང་མ་ཡིན། བསམས་པ་ཙམ་གྱིས་སྒྲིབ་པ་མེད་པར་འབྱུང་བ་ཡང་མ་ཡིན་ནོ། །
en: Being unhindered does not occur in relation to passing through mountains and the like, or in relation to their mere intentions.

source: དེ་བཞིན་དུ་བག་ཡོད་པ་རྣམས་ཀྱི་དགེ་བ་མངོན་པར་འདུ་བྱེད་པའི་རྐྱེན་གྱིས་ཡང་སྲིད་པའི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་འབྱུང་ངོ་། །
en: In the same way, the ripening force in the next existence is based on the contrived virtue of those who are vigilant.

source: འདི་ལྟ་སྟེ། དཔེར་ན་རླུང་གི་རྐྱེན་གྱིས་མེ་འབྱུང་གི །
en: (9) “As a further analogy, fires ignite based on the condition of air.

source: དེ་མེད་ན་མི་འབྱུང་སྟེ།
en: Without air, it will not ignite.

source: མེ་བྱུང་ནས་ཚོས་པར་བྱ་བར་སྣང་བ་ལ་སོགས་པར་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་འབྱུང་ཡང་། མེའི་དབང་བ་དེ་རླུང་དང་ཤིང་རྣམས་ལ་མི་འཕོ་ལ། མེ་ལ་མེའི་དབང་བ་ཉིད་ཡོད་པ་ཡང་མ་ཡིན་ནོ། །
en: Once a fire has ignited, the ripening force for it to appear as something that cooks and so forth will occur, but the air and wood do not transfer to the fire’s capacity, nor does the capacity of the fire exist in the fire.

source: དེ་བཞིན་དུ་རྐྱེན་ཐམས་ཅད་ལས་སྐྱེས་པའི་དགེ་བ་དང་མི་དགེ་བའི་རྣམ་པར་སྨིན་པ་ཡང་སོ་སོར་ཁོང་དུ་ཆུད་པར་བྱའོ། །འདི་ལྟ་སྟེ།
en: The ripening of virtue and nonvirtue born from any conditions should be individually understood in the same way.

source: དཔེར་ན་རྣལ་འབྱོར་སྤྱོད་པའི་དགེ་སློང་དགེ་བ་ཟད་པ་མེད་པའི་ཚོགས་རྣམ་པར་དག་པ། དབང་རབ་ཏུ་ཐོབ་པས་ཟད་པར་ནམ་མཁའ་བསམས་པ་ཙམ་གྱིས་དེ་བཞིན་དུ་འགྱུར་ཏེ། སྲ་བ་དང་།
en: (10) “As a further analogy, when a monk engaged in yogic practice who has purified the collection of uncontaminated virtue attains power, he can, merely by thinking of it, become just like space among the objects of meditative immersion.

source: གཤེར་བ་དང་། ཚ་བ་དང་། གཡོ་བ་རྣམས་དང་། སྔོན་པོ་དང་། སེར་པོ་དང་།
en: He will become unobstructed by solidity, wetness, heat, and movement, as well as blue, yellow, red, and white.

source: དམར་པོ་དང་། དཀར་པོ་རྣམས་ཀྱི་སྒྲིབ་པ་མེད་པར་འགྱུར་ཡང་། སེམས་ཀྱི་སྒྲིབ་པ་མེད་པ་ནམ་མཁའི་སྒྲིབ་པ་མེད་པར་འཕོ་བ་ཡང་མ་ཡིན།
en: And yet, the mind’s lack of obscuration is not transferred to the lack of obscuration of space.

source: བསམས་པ་ཙམ་གྱིས་སྒྲིབ་པ་མེད་པར་འགྱུར་བ་ཡང་མ་ཡིན། སེམས་ཀྱི་སྒྲིབ་པ་མེད་པ་དེ་དང་མི་ལྡན་པར་སྲ་བ་ལ་སོགས་པའི་སྒྲིབ་པ་མེད་པར་འགྱུར་བ་ཡང་མ་ཡིན་ནོ། །
en: It is also not the case that one becomes unobscured merely by thinking it, nor does a lack of obscuration in regard to solidity and the rest occur in the absence of lacking mental obscuration.

source: དེ་བཞིན་དུ་རྐྱེན་ལས་བྱུང་བའི་དགེ་བ་དང་མི་དགེ་བ་ཐམས་ཅད་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: The ripening force of any virtue or nonvirtue born from conditions should be understood in the same way.

source: བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུ་པོ་དེ་དག་གིས་དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པའི་དབང་བ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Bodhisattvas should understand the ripening power of the virtues through these ten approaches to the way of the Dharma.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པ་བཅུས་ཟག་པ་མེད་པའི་དགེ་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་འཐོབ་པའི་དབང་བ་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་སྟེ། བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མངོན་པར་ཤེས་པ་དྲུག་དང་། རིག་པ་གསུམ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། ཟིལ་གྱིས་གནོན་པའི་སྐྱེ་མཆེད་བརྒྱད་དང་།
en: “Child of good family, bodhisattvas should understand the force of attaining the ripening of the undefiled virtues through ten approaches to the way of the Dharma.

source: ཟད་པར་གྱི་སྐྱེ་མཆེད་བཅུ་དང་།
en: What are these ten?

source: དབང་བཅུ་དང་། བདེན་པ་བཅུ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོབས་བཅུ་དང་། ཤེས་པ་བཅུའོ། །
en: (1) The six higher cognitions, (2) the three types of knowledge, (3) the eight liberations, (4) the eight domains of mastery, (5) the ten objects of meditative immersion, (6) the ten powers, (7) the ten truths, (8) the nine successive states of meditative attainment, (9) the ten strengths, and (10) the ten types of knowledge.

source: དེ་ལ་མངོན་པར་ཤེས་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six higher cognitions?

source: ལྷའི་མིག་དང་། ལྷའི་རྣ་བ་དང་། ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དང་། སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་དང་། རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་དང་།
en: Divine sight, divine hearing, knowing the minds of others, recalling previous states, creating miraculous emanations, and knowing the exhaustion of contaminants.

source: ཟག་པ་ཟད་པ་ཤེས་པ་སྟེ། འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་ཤེས་པ་དྲུག་གོ། །
en: These are the six higher cognitions of the bodhisattvas.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་མིག་གང་ཞེ་ན།
en: “What is a bodhisattva’s divine sight?

source: དགེ་བའི་ཚོགས་ཐམས་ཅད་བསགས་པ་མ་ཉམས་པ། ཆགས་པ་མེད་པ། ཚད་མེད་པ། སྒྲིབ་པ་མེད་པ། གནས་པ་མེད་པ། རྨ་མེད་པ། འཁྲུལ་པ་མེད་པ།
en: It is an undiminished gathering of all collections of virtue; it is unimpeded, immeasurable, unobscured, unfixed, unblemished, unconfused, indemonstrable, and irreproachable.

source: བསྟན་དུ་མེད་པ། ཁ་ན་མ་ཐོ་བ་མེད་པ། འཇིག་རྟེན་ཐམས་ཅད་དང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་དང་ཐུན་མོང་མ་ཡིན་པ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པ།
en: It is not shared by worldly beings, śrāvakas, or pratyekabuddhas, and has completely overcome the nexus of habitual patterns.

source: ཕྱད་པར་མཐོང་བ། ཕྱད་པར་ལུང་སྟོན་པ་སྟེ།
en: It sees constantly and is continuously prophetic.

source: ལྷའི་མིག་དེས་སེམས་ཅན་རྣམས་མཐོང་སྟེ། འཆི་འཕོ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་པོ་དང་།
en: Bodhisattvas see all beings with this divine eye.

source: ཁ་དོག་ངན་པ་དང་། ཐ་མ་དང་། མཆོག་དང་། ལས་ཉེ་བར་འགྲོ་བ་ཇི་ལྟ་བ་དང་། རྒྱུ་དང་བཅས་པ་དང་རྣམ་པར་སྨིན་པ་དང་བཅས་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ངོ་། །
en: They accurately see death and birth, the attractive and unattractive, the inferior and superior, and they accurately see the way karma unfolds with its causes and results.

source: དེའི་ལྷའི་མིག་དེ་ནི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པ་སྟེ།
en: A bodhisattva’s divine eyes lead to the attainment of awakened wisdom.

source: དེར་ངེས་པ་ཡིན་ནོ། །
en: That is certain.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་རྣ་བ་ནི་དེ་ལྷའི་རྣ་བ་སྒྲིབ་པ་མེད་པ། དགེ་བའི་ཚོགས་ཐམས་ཅད་བསགས་པ། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་།
en: “A bodhisattva’s divine hearing is an unobscured divine hearing, a gathering of all collections of virtue.

source: ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ། ཆོད་པ་མེད་པ་འོད་གསལ་བས་སྒྲ་ཐམས་ཅད་ཐོས་ཏེ། ལྷ་དང་།
en: More exalted than the hearing of ordinary naive people, śakras, brahmās, all world guardians, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and all śrāvakas and pratyekabuddhas, they hear all sounds through uninterrupted luminosity.

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་།
en: They hear the sounds of the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, and even those of flies, ants, and mosquitoes.

source: ལྟོ་འཕྱེ་ཆེན་པོའི་སྒྲ་དང་། ཐ་ན་སྦྲང་བུ་དང་། གྲོག་མ་དང་། ཤ་སྦྲང་དང་། འཕགས་པ་དང་འཕགས་པ་མ་ཡིན་པའི་སྒྲ་རྣམས་ཀྱང་ཐོས་ཏེ།
en: They hear sounds both noble and ignoble.

source: ཐོས་ནས་ཀྱང་འཕགས་པ་མ་ཡིན་པའི་སྒྲ་རྣམས་ལ་ཁོང་ཁྲོ་བར་ཡང་མི་བྱེད། འཕགས་པའི་སྒྲ་རྣམས་ལ་རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱེད།
en: They do not get angry when they hear ignoble sounds, nor do they become enamored with noble sounds.

source: སོ་སོའི་སྐྱེ་བོའི་སྒྲ་རྣམས་ལ་ཐ་མར་འདུ་ཤེས་པ་ཡང་མ་ཡིན། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སྒྲ་རྣམས་ལ་དམ་པར་འདུ་ཤེས་པ་ཡང་མ་ཡིན།
en: They do not perceive the sounds of ordinary people to be base, nor do they perceive the sounds of śrāvakas and pratyekabuddhas to be exalted.

source: འཕགས་པ་མ་ཡིན་པའི་ཚུལ་ལ་ཁོང་ཁྲོ་བར་ཡང་མི་བྱེད། འཕགས་པའི་ཚུལ་ལ་རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱེད།
en: They do not become angry with the comportment of the ignoble, nor enamored with the comportment of the noble.

source: སྒྲ་གང་ལ་ཡང་ཡོན་ཏན་དུ་འདུ་ཤེས་པའམ། ཉེས་པར་འདུ་ཤེས་པ་མ་ཡིན་ཏེ།
en: They perceive neither good qualities in the sounds they hear, nor faults.

source: གཞན་དུ་ན་སྒྲ་ཐམས་ཅད་བྲག་ཅ་ལྟ་བུ་དང་། སྟོང་པ་དང་། གཡོ་བ་མེད་པ་དང་། བདག་དང་བདག་གི་མེད་ཅིང་དབེན་པར་རབ་ཏུ་ཤེས་ཀྱང་རྣ་བའི་སྐྱེ་མཆེད་འབད་པ་ཡང་མ་ཡིན། སྒྲའི་སྐྱེ་མཆེད་འབད་པ་ཡང་མ་ཡིན་ཏེ།
en: Instead, they recognize that sound is like an echo, empty and unmoving, lacking and devoid of ‘I’ and ‘mine,’ and so do not invest any effort in the sense bases of the ear and sound.

source: བྱང་ཆུབ་སེམས་དཔའི་ལྷའི་རྣ་བ་ནི་འདི་ལྟ་བུ་ཡིན་ནོ། །
en: Such is the divine hearing of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ནི་རང་གི་སེམས་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: “A bodhisattva’s capacity to know the minds of others indicates they possess knowledge of their own minds.

source: དེ་རང་གི་སེམས་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་རབ་ཏུ་ཤེས་ཏེ།
en: Because they know their own minds, they are aware of the thoughts and deeds of all beings.

source: སེམས་ཅན་གཞན་རྣམས་དང་གང་ཟག་གཞན་དག་གི་འདོད་ཆགས་དང་བཅས་པའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བཅས་པའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས།
en: Some other beings and people have desirous minds, and bodhisattvas are precisely aware of those desirous minds.

source: འདོད་ཆགས་དང་བྲལ་བའི་སེམས་ཀྱང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: Some have minds free of desire, and bodhisattvas are precisely aware of minds that are free of desire.

source: ཤེས་ནས་ཀྱང་གང་འདོད་ཆགས་དང་བཅས་པའི་སེམས་དེ་ལ་ཁོང་ཁྲོ་བར་ཡང་མི་བྱེད།
en: Even though they know this, they do not become angry with desirous minds, nor do they become enamored with those minds that are free of desire.

source: གང་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་དེ་ལ་རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱེད་དེ། གཞན་དུ་ན་འདོད་ཆགས་དང་བཅས་པ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་རྙེད་དོ། །འདོད་ཆགས་དང་བྲལ་བ་རྣམས་ལ་བྱམས་པ་ཆེན་པོ་རྙེད་དོ། །
en: Instead, they discover great compassion for those with desirous minds, and discover great love for those whose minds are free of desire.
